app/controllers/login_controller.rb

INSERT INTO "shops" ("created_at", "updated_at", "subdomain", "site", "processing") VALUES('2010-01-09 12:13:21', '2010-01-09 12:13:21', 'jessetesting', 'https://9ed77f6baede1c9266ff0055f7303005:cecd2b54d27e8e0d60bb62ab9145e238@jessetesting.myshopify.com/admin', NULL)
SELECT "shops".id FROM "shops" WHERE ("shops"."subdomain" = 'jessetesting') LIMIT 1
---
  def finalize
    shopify_session = ShopifyAPI::Session.new(params[:shop], params[:t], params)
    if shopify_session.valid?
      session[:shopify] = shopify_session
      flash[:notice] = "Logged in to shopify store."

      Shop.find_or_create_by_subdomain(:subdomain => session[:shopify].subdomain,
                                       :site => session[:shopify].site)