app/controllers/payment_notification_controller.rb

  def create
    ShopifyAPI::ApplicationCharge.find(params[:charge_id]).activate
    @translation = Translation.find(params[:translation_id])
    @translation.update_attributes!(:paid => true)
---
SELECT * FROM "translations" WHERE ("translations"."id" = 3)
UPDATE "translations" SET "updated_at" = '2010-01-09 12:56:44', "paid" = 't' WHERE "id" = 3