app/controllers/translations_controller.rb

SELECT * FROM "translations" WHERE ("translations"."shop_id" = 1 AND "translations"."to_lang" = 'cs') AND ("translations".shop_id = 1) LIMIT 1
UPDATE "shops" SET "updated_at" = '2010-01-09 12:47:43', "processing" = 't' WHERE "id" = 1
---
  def create
    @translation = @shop.translations.find_or_initialize_by_shop_id_and_to_lang(params[:translation].merge(:shop_id => @shop.id))

    if @translation.save

SELECT "shops".id FROM "shops" WHERE ("shops"."subdomain" = 'jessetesting' AND "shops".id <> 1) LIMIT 1
---
  def load_shop
    @shop = Shop.find_by_subdomain(session[:shopify].subdomain)